; ###### New Items ######

[RageVest X2EquipmentTemplate]
FriendlyName="R.A.G.E. Vest"
FriendlyNamePlural="R.A.G.E. Vests"
BriefSummary="The R.A.G.E. Vest triggers a massive spike of adrenaline production and assists the wearer with biosynthetic muscle fibers, granting super-human strength for a short period of time. Soldiers should use this technology sparingly as the long term effects to the human body are still unknown."
TacticalText="<Bullet/> Increases soldier health.\n<Bullet/> Soldiers under the influence of the R.A.G.E. Vest's effect are capable of delivering a devastating melee attack with their bare fists."

[FrostHook X2WeaponTemplate]
FriendlyName="Frost Hook"
FriendlyNamePlural="Frost Hooks"
BriefSummary="Infused with the Viper King's frigid venom, the Frost Hook freezes in place any enemy hit by it. It has been specifically designed to fit with any of our existing grappling devices."
TacticalText="<Bullet/> The Frost Hook can be used to pull enemy units out of cover.\n<Bullet/> Upon impact, frigid venom is sprayed on the target, freezing them in place."

[IcarusJets X2EquipmentTemplate]
FriendlyName="Icarus Jets"
FriendlyNamePlural="Icarus Jets"
BriefSummary="The flights component recovered from the Archon King have led us to develop the Icarus Jets, a built-in propulsion system for our own armors. The Icarus Jets allow temporary flight, enabling the wearer to rapidly change locations."
TacticalText="<Bullet/>The Icarus Jets allow a soldier to instantly leap to a new location."

; ###### New Techs ######

[RageVest X2TechTemplate]
DisplayName="R.A.G.E. Vest"
Summary="It may be possible to create a high-powered body vest by integrating biosynthetic muscle fibers made from Berserker specimens along with an auxiliary adrenaline injection system similar to the one attached on the Berserker Queen's body."

[FrostHook X2TechTemplate]
DisplayName="Frost Hook"
Summary="By studying what remains of the Viper King, it might be possible to synthetize additional frigid venom from common Viper glands. A long range grappling hook would be an elegant solution to deliver the noxious toxin from safe distance."

[IcarusJets X2TechTemplate]
DisplayName="Icarus Jets"
Summary="With our knowledge of the Archon King's advanced flight mechanism, it should be possible to repurpose and upgrade the jets scavenged from ordinary Archons to create a flight-capable propulsion system for our own soldiers."

; ###### Vanilla Override ######

; ### Abilities ###
[IcarusJump X2AbilityTemplate]
LocFriendlyName="Icarus Jump"
LocLongDescription="The Icarus Jets use a unique propulsion system allowing our soldiers to instantly launch themselves to a new position."
LocHelpText="Jump to a new location. Bypasses all overwatch and reaction fire."
LocFlyOverText="Icarus Jump"

; ### Techs ###
[AutopsyArchonKing X2TechTemplate]
DisplayName="Archon King Autopsy"
Summary="Dr. Vahlen managed to improve on this creature's key systems while somehow maintaining the no-doubt carefully crafted appearance conceived by the aliens. Although apparently similar to the standard Archon variant, as seen in the field this specimen has advanced flight capabilities beyond anything we've previously encountered. It may be possible to adapt this technology into a flight-capable propulsion system of our own."
CodeName="Daedalus"
LongDescription="The modified Archon variant known to Dr. Vahlen as \"Alpha\" has not only been genetically altered, but also upgraded accordingly with equipment directly tied to its unusual abilities. Again I have to question the logic in providing enhanced offensive capabilities to an otherwise hostile alien species, even if Vahlen had intended on turning these creatures against their former masters.\n\nAlthough I had little exposure to the rudimentary biomechanical predecessors to the modern Archon, I can say with certainty that Vahlen's Alpha is no doubt the most physically and technologically advanced of any of the aliens' earlier renditions of this species. From our field reports, it seems the creature had a terrifying propensity to seize upon its target before rapidly climbing in altitude and then dropping the helpless victim. I believe our troops have done a great service in eliminating this particular threat. R. Tygan."

[AutopsyBerserkerQueen X2TechTemplate]
DisplayName="Berserker Queen Autopsy"
Summary="As if the standard Berserker wasn't enough for our troops to deal with, this particular specimen has been substantially modified with some form of auxiliary injection system circulating fluids throughout its body. I believe it may be possible to modify these systems for use in a protective vest of our own, but the fabrication process could a challenge." 
CodeName="Hulk"
LongDescription="Despite a thorough examination of the modified Berserker variant known as subject \"Beta,\" I've yet to uncover any meaningful justification for the enhanced equipment provided by Dr. Vahlen to the creature as it relates to her own research. Let me be clear, I fully understand the creature's enhanced endocrine system requires the addition of this supplementary transport and filtering mechanism to maintain hormonal equilibrium. As well, I admit it is a reasonably elegant solution to an otherwise daunting question.\n\nWhat I cannot understand is, why it was necessary for Dr. Vahlen to take this relative certainty beyond the theoretical stage. There was no need for a \"proof of concept\" here, the end result was no doubt as clear to her then as it is to me now. I firmly believe she made a conscious decision to see her work through to the end, knowing full well the risks not only to herself but to everyone else who might encounter subject Beta in the future. I am thankful we found the creature when we did, and that our forces were capable of neutralizing such a formidable enemy.\n\nThe senior staff has agreed that the remains of Beta would best be utilized as part of an enhanced protective vest, although the actual conversion process sounds like something that would have been better handled by Dr. Vahlen herself. R. Tygan."  

[AutopsyViperKing X2TechTemplate]
DisplayName="Viper King Autopsy"
Summary="Although clearly reminiscent of the known Viper species we encounter with some regularity, this specimen is unique for a number of reasons, not the least of which is its gender, this being the only male Viper ever reported. It may be possible to repurpose some facet of its biology for use in our own weapon development programs."
CodeName="Scorpion"
LongDescription="Having carefully studied what remains of Dr. Vahlen's personal research reports, I've slowly come to understand the depths of her intellectual curiosity and the degree to which she was consumed by her ambition. By reversing key changes to the Viper's genetic structure, traits intentionally suppressed by the aliens, she created this, subject \"Gamma\" - the Viper \"King.\"\n\nThe idea of a Viper patriarch is in itself intriguing, considering there have been no previous sightings of any male members of the species. Vahlen theorized this may have been an intentional form of population control, the Elders' having restricted their subordinate species ability to breed. Having seen the apparent nesting site created by Gamma and the discovery of egg clutches (none of which were left viable for sampling), I can say with some confidence that creature did immediately set out to pursue the natural instincts that had long since been restrained through genetic tampering.\n\nAs of yet I have no explanation as to how the Viper's venom glands were effected in such a way as to change their form and function so dramatically; further study will be necessary, but I've promised to allow some of Gamma's remains to be utilized towards a new conceptual weapon design. R. Tygan."